{
    "historic_event": [
        {
            "name":"Cuộc khởi nghĩa Hai Bà Trưng",
            "location": "Giao Chỉ (tương đương một phần Quảng Tây, Trung Quốc và Bắc Bộ, Bắc Trung Bộ Việt Nam hiện nay)",
            "time": "Nổ ra vào mùa xuân năm Canh Tý (40CN)",
            "causes": "Sau khi ông Thi Sách bị giết, bà Trắc quyết chí phục thù trả oán. Bà tiến hành tổ chức chứa tích lương thực, vận động thu dùng các anh hùng hào kiệt trung thiên hạ, những người cùng chí hướng, chiêu binh tuyển tướng ở các địa phương",
            "battle" : "Lần 1 : Hai Hà Trưng là Trưng Trắc và Trưng Nhị phất cờ khởi nghĩa vào mùa xuân năm 40 tại Hát Môn (nay là xã Hát Môn – Phúc Thọ – Hà Nội). Lần 2 : Tháng 3 năm 43, Hai Bà Trưng hy sinh ở Cẩm Khê. Cuộc kháng chiến vẫn kéo dài đến tháng 11 năm 43 sau đó mới bị dập tắt.",
            "consequences": "hậu quả",
            "significance": "Cuộc khởi nghĩa Hai Bà Trưng năm 40 đã khôi phục được nền độc lập của dân tộc, mở ra một trang mới trong lịch sử.Trong và sau thời gian diễn ra cuộc khởi nghĩa Hai Bà Trưng đã cho thấy được tinh thần yêu nước, ý chí quyết đấu, quyết thắng của nhân dân trong việc giành lại độc lập chủ quyền của đất nước",
            "result": "Cuộc khởi nghĩa của Hai Bà Trưng dành được thắng lợi lần 1 vào năm 40 nhưng lại gặp phải thất bại sau khi nhà Hán tăng cường chi viện vào năm 42 và cuộc kháng chiến kéo dài đến hết năm 43 mới kết thúc."
        },
        {
            "name":"Loạn 12 sứ quân",
            "location": "Đại la (nằm ở vị trí giữa Thành Hà Nội và sông Tô Lịch, thuộc quận Ba Đình của Hà Nội hiện nay)",
            "time": "năm 966 (Bính Dần)",
            "causes": "Lợi dụng tình hình lục đục trong dòng họ Ngô và chính quyền trung ương, các thổ hào nhiều nơi nổi dậy, mỗi người hùng cứ một vùng, đem quân đánh lẫn nhau, sử chép là “Loạn 12 sứ quân",
            "battle" : "Năm 944 (Giáp Thìn) Ngô Quyền mất, con là Ngô Xương Ngập nối ngôi, em vợ là Dương Tam Kha giúp đỡ.Năm 945 (Ất tỵ) Dương Tam Kha cướp ngôi, tự xưng là Bình vương. Triều Ngô, đến đời Ngô Xương Văn cai trị được 15 năm đến 965, đất nước rơi vào cảnh loạn lạc, đến đây nhà Ngô bị suy yếu và sụp đổ",
            "consequences": "Loạn 12 sứ quân dẫn đến tình trạng xóa bỏ chính quyền Trung ương, xu hướng chia cắt phân tán lực lượng tạo điều kiện thuận lợi cho các thế lực xâm lược mà trực tiếp là cường quyền Trung Hoa thâu tóm và khôi phục lại ách đô hộ cũ",
            "significance": "Thắng lợi của Đinh Bộ Lĩnh trong dẹp loạn 12 sứ quân và lập nên nhà nước Đại Cồ Việt là thắng lợi của tinh thần tự lập, tự cường, tự tôn dân tộc. Đó cũng là thắng lợi có tính thời đại sâu sắc – thống nhất quốc gia, xây dựng nhà nước phong kiến trung ương tập quyền vững mạnh, trước nguy cơ xâm lấn của ngoại bang phương bắc - mở đầu cho các triều đại phong kiến nước ta sau này.",
            "result": "Nhà nước Đại Cồ Việt hình thành"
        },
        {
            "name":"Chiến thắng Điện Biên Phủ",
            "location": "Thung lũng Mường Thanh, Điện Biên Phủ",
            "time": "13 tháng 3 - 7 tháng 5 năm 1954",
            "causes": "Áp bức bóc lột của thực dân Pháp",
            "battle" : "Giai đoạn 1: Từ ngày 13 đến 17-3-1954, quân ta đã tiêu diệt gọn cứ điểm Him Lam và Độc Lập, bức hàng cứ điểm Bản Kéo, phá vỡ cửa ngõ phía Bắc của tập đoàn cứ điểm Điện Biên Phủ; diệt và bắt sống trên 2.000 tên địch, phá hủy 25 máy bay, xóa sổ 1 trung đoàn, uy hiếp sân bay Mường Thanh; Pi rốt, Tư lệnh pháo binh Pháp ở Điện Biên Phủ bất lực trước pháo binh của ta đã dùng lựu đạn tự sát.Giai đoạn 2: Từ ngày 30-3 đến 30-4-1954, quân ta đồng loạt tiến công các cứ điểm phía Đông phân khu trung tâm; thắt chặt vòng vây, chia cắt, kiểm soát sân bay Mường Thanh, hạn chế tiếp viện của địch cho Tập đoàn cứ điểm.Giai đoạn 3: Từ ngày 1 đến 7-5-1954, ta đánh dứt điểm dãy đồi phía Đông và tổng tiến công tiêu diệt các vị trí còn lại, bắt sống Tướng De Castries, kết thúc chiến dịch.",
            "consequences": "Thiệt hại về phía Pháp là 1.747 tới 2.293 người chết, 5.240 tới 6.650 người bị thương, 1.729 người mất tích và 11.721 bị bắt làm tù binh",
            "significance": "Trong cuộc kháng chiến chống thực dân Pháp, chiến thắng Điện Biên Phủ là chiến thắng vĩ đại nhất, giáng đòn quyết định tạo bước ngoặt lịch sử làm thay đổi hẳn cục diện chiến tranh giữa ta và địch, trực tiếp đưa đến việc ký kết Hiệp định Giơnevơ về chấm dứt chiến tranh, lập lại hòa bình ở Đông Dương.",
            "result": "Sau 56 ngày đêm chiến đấu cực kỳ anh dũng, chiến dịch lịch sử Điện Biên Phủ đã toàn thắng. Ta tiêu diệt và bắt sống 16.200 tên địch, bắn rơi và phá huỷ 62 máy bay, thu toàn bộ vũ khí, kho xăng, đạn dược, quân trang quân dụng."
        },
        {
            "name":"Bạch Đằng chiến",
            "location": "Sông Bạch Đằng",
            "time": "938 (Mậu Tuất)",
            "causes": "Năm 937, Đình Nghệ bị nha tướng Kiều Công Tiễn giết hại để cướp ngôi Tiết độ sứ. Con rể và là một tướng khác của Đình Nghệ là Ngô Quyền bèn tập hợp lực lượng ra đánh Công Tiễn để trị tội phản chủ.Kiều Công Tiễn sợ hãi, bèn sai người sang cầu cứu Nam Hán. Vua Nam Hán là Lưu Nghiễm nhân cơ hội đó bèn quyết định đánh Tĩnh Hải quân lần thứ hai. Lưu Nghiễm cho rằng Dương Đình Nghệ qua đời thì Tĩnh Hải quân không còn tướng giỏi, bèn phong cho con trai thứ 9 là Lưu Hoằng Tháo làm Bình Hải tướng quân và Giao Chỉ vương, thống lĩnh thủy quân.",
            "battle" : "Vào một ngày cuối đông năm 938, trên sông Bạch Đằng, vùng cửa biển và hạ lưu, cả một đoàn binh thuyền do Hoằng Tháo chỉ huy vừa vượt biển tiến vào cửa ngõ Bạch Đằng.Quân Nam Hán thấy quân của Ngô Quyền chỉ có thuyền nhẹ, quân ít tưởng có thể ăn tươi, nuốt sống liền hùng hổ tiến vào. Ngô Quyền ra lệnh cho quân bỏ chạy lên thượng lưu. Đợi đến khi thủy triều xuống, ông mới hạ lệnh cho quân sĩ đổ ra đánh. Thuyền chiến lớn của Nam Hán bị mắc cạn và lần lượt bị cọc đâm thủng gần hết. Lúc đó Ngô Quyền mới tung quân ra tấn công dữ dội. Quân Nam Hán thua chạy, còn Lưu Hoằng Tháo bỏ mạng với hơn một nửa quân sĩ.",
            "consequences": "Thuyền chiến lớn của Nam Hán bị mắc cạn và lần lượt bị cọc đâm thủng gần hết. Quân Nam Hán thua chạy, còn Lưu Hoằng Tháo bỏ mạng với hơn một nửa quân sĩ.",
            "significance": "Chấm dứt 1000 năm Bắc thuộc trong lịch sử Việt Nam, mở ra một thời kỳ độc lập tự chủ cho Việt Nam.",
            "result": "Tĩnh Hải quân đại thắng, chấm dứt hoàn toàn thời kỳ Bắc thuộc.Năm 939, Ngô Quyền lên ngôi vua, xưng là Ngô Vương, lập ra nhà Ngô, đóng đô ở Cổ Loa (Đông Anh, Hà Nội ngày nay)."
        },
        {
            "name":"Khởi nghĩa Lý Bí",
            "location": "Thái Bình (Sơn Tây)",
            "time": "542 (Nhâm Tuất)",
            "causes": "Do chính sách cai trị tàn bạo của nhà Lương với nhân dân Giao Châu. Chúng thực hiện chính sách phân biệt đối xử với người Việt, nhân dân phải chịu tô thuế nặng nề khiến đời sống dân khổ cực.",
            "battle" : "Cuộc khởi nghĩa của Lý Bí được sự ủng hộ của nhân dân khắp nơi, sau 3 tháng từ khi cuộc khởi nghĩa Lý Bí diễn ra, nghĩa quân đã giành được thắng lợi, chiếm được hầu hết các quận, huyện. Thứ sử Tiêu Tư của nhà Lương hoảng sợ, đã bỏ thành Long Biên (nay là Bắc Ninh) bỏ chạy về Trung Quốc.",
            "consequences": "",
            "significance": "Nước Vạn Xuân được thành lập, có nhà nước riêng, chế độ cai trị tự chủ, đưa đất nước thoát khỏi ách thống trị của nhà Lương.Cuộc khởi nghĩa Lý Bí đã giành lại được độc lập cho nước ta, thể hiện được ý chí, lòng yêu nước và tinh thần chiến đấu của nhân dân.",
            "result": "năm 544, Lý Bí lên ngôi làm hoàng đến lấy tên là Lý Nam Đế, đặt tên nước là Vạn Xuân, dựng kinh đô tại cửa sông Tô Lịch."
        },
        {
            "name":"Quân Nguyên xâm lược Đại Việt lần thứ hai",
            "location": "Bắc Bộ và Bắc Trung Bộ Việt Nam",
            "time": "1285 (Ất Dậu)",
            "causes": "Đại Việt chống lại sự xâm lược của nhà Nguyên",
            "battle" : "Quân Trần phòng ngự và rút lui (Trận Sơn Động, Trận Vạn Kiếp, Trận sông Đuống, Trận Thăng Long, Trận Thu Vật, Các trận đánh trên sông Hồng, Quân Trần tập hợp lại lực lượng, Toa Đô bắc tiến)",
            "consequences": "quân Nguyên chết rất nhiều, thây nằm ngổn ngang, máu chảy thành suối. Đại Việt Sử ký Toàn thư chép rằng Lý Quán thu tàn quân chỉ còn lại 5 vạn người so với 50 vạn khi bắt đầu sang Đại Việt, tức là có tới 45 vạn quân Nguyên đã chết hoặc bị bắt.",
            "significance": "Cuộc kháng chiến của quân dân Đại Việt dưới sự lãnh đạo của hai vua Trần Thánh Tông và Nhân Tông đã toàn thắng, thể hiện Hào khí Đông A của Đại Việt thời ấy. Nhà Trần lần thứ hai đánh đuổi được quân Mông Nguyên, lần này với quy mô lớn hơn nhiều và hoàn cảnh khó khăn hơn nhiều.",
            "result": "Quân Đại Việt chiến thắng,Nguyên Mông phải rút lui khỏi Đại Việt"
        },
        {
            "name":"Quân Nguyên xâm lược Đại Việt lần thứ ba",
            "location": "Bắc Bộ Việt Nam",
            "time": "1287-1288",
            "causes": "Đại Việt chống lại sự xâm lược của nhà Nguyên",
            "battle" : "Trận Vạn Kiếp và phía tây bắc nước ta, Trận Cao Lạng, Trận Thăng Long, Trận Vân Đồn, Thoát Hoan rút về Vạn Kiếp, Trận Bạch Đằng",
            "consequences": "Kế hoạch xâm lược Đại Việt của nhà Nguyên một lần nữa thất bại. Một số tướng lĩnh xuất sắc của nhà Nguyên đã chết, như Abaci, Ô Mã Nhi, Phàn Tiếp. Phần lớn chiến thuyền của quân Nguyên bị tiêu diệt hoặc bắt giữ. Số lượng binh sĩ tử trận là không nhỏ, đặc biệt là lực lượng thủy quân bị tiêu diệt gần như toàn bộ.Về phía Đại Việt, tuy đã làm phá sản kế hoạch xâm lược của quân Nguyên, nhưng nhiều tướng sỹ đã tử trận.",
            "significance": "Nhà Trần một lần nữa lại lập võ công đẩy lui được một cuộc xâm lược quy mô của nhà Nguyên, giữ vững được bờ cõi. Trận Bạch Đằng, 1288 cũng được ghi nhận là một trong những trận đánh nổi tiếng nhất trong lịch sử Việt Nam. Tuy nhiên, thắng lợi lần thứ ba chưa thực sự chấm dứt được chiến tranh. Sau cuộc chiến, nhà Trần đã chủ động dùng biện pháp ngoại giao để lập lại hoà bình; Hốt Tất Liệt vẫn muốn tiếp tục động binh trong những năm sau nhưng chưa có cơ hội thuận lợi. Năm 1294, Hốt Tất Liệt qua đời, Thiết Mộc Nhĩ lên ngôi ngừng việc phát động chiến tranh với Đại Việt. Khi đó chiến tranh mới thực sự chấm dứt.",
            "result": "Quân Đại Việt toàn thắng, Nguyên Mông phải rút lui khỏi Đại Việt"
        },
        {
            "name":"Trận Ngọc Hồi – Đống Đa",
            "location": "Miền Bắc Đại Việt",
            "time": "1788 – 1789",
            "causes": "Do sự tranh chấp về quyền lực, Nguyễn Nhạc và Nguyễn Huệ nổ ra xung đột đầu năm 1787. nhân cơ hội đó, các lực lượng chống Tây Sơn trỗi dậy. Phía nam, Nguyễn Ánh nhờ sự giúp đỡ của người Pháp, trở về đánh chiếm Gia Định. Đông Định vương nhà Tây Sơn là Nguyễn Lữ bỏ Gia Định về Quy Nhơn. Phía bắc, các lực lượng thân họ Trịnh dựng lại người trong tông tộc là Trịnh Bồng lên ngôi, bị tướng Bắc Hà đã hàng Tây Sơn là Nguyễn Hữu Chỉnh từ Nghệ An kéo ra đánh bại. Chỉnh ra cầm quyền ở Thăng Long mưu thay chúa Trịnh chống Tây Sơn.",
            "battle" : "Ngày 29 tháng 11 năm Mậu Thân (26 tháng 12 năm 1788), đại quân của hoàng đế Quang Trung tới Nghệ An, dừng quân tại đó hơn 10 ngày để tuyển quân và củng cố lực lượng, nâng quân số lên 10 vạn, tổ chức thành 5 đạo quân: tiền, hậu, tả, hữu và trung quân. Ngoài ra còn có một đội tượng binh với 200 voi chiến. Vua Quang Trung còn tổ chức lễ duyệt binh ngay tại Nghệ An để khích lệ ý chí quyết chiến, quyết thắng của tướng sĩ đối với quân xâm lược Mãn Thanh",
            "consequences": "Nhà Tây Sơn hơn 8000 người chết. Phía Đại Thanh một nửa quân số, tối thiểu là 20.000 (chưa kể tổn thất của dân binh) 3.400 tù binh",
            "significance": "Chiến thắng Kỷ Dậu 1789 là một trong những trận chiến chống ngoại xâm nổi tiếng nhất trong lịch sử Việt Nam và cũng được các nhà nghiên cứu Việt Nam như Nguyễn Lương Bích và Phạm Ngọc Phụng đánh giá là chiến công oanh liệt nhất của hoàng đế bách chiến bách thắng Nguyễn Huệ. Chiến thắng này đã chặn đứng ý định xâm chiếm Đại Việt của nhà Thanh dưới thời Càn Long thịnh trị",
            "result": "Tây Sơn chiến thắng, quân Thanh rút khỏi Đại Việt. Nhà Tây Sơn thay thế nhà Hậu Lê. Nhà Tây Sơn chấp nhận triều cống cho nhà Thanh để lập quan hệ bang giao."
        }
    ]
}