{
    "info_characters": [
        {
            "name":"An Dương Vương",
            "brief": "An Dương Vương (chữ Hán: 安陽王), tên thật là Thục Phán (蜀泮), là con trai của vua Tày Thục Chế và là cháu của Thục vương Lư Tử bá vương",
            "born": "-1",
            "birthday": "-1",
            "died": "năm 208 TCN / 179 TCN",
            "position": "Vua (lập nên đất nước Âu Lạc)",
            "education": "-1",
            "knownfor": "Ông là vị vua vĩ đại đã mở rộng lãnh thổ nước Âu Việt, lập nên đất nước Âu Lạc và cũng là vị vua duy nhất cai trị nhà nước này",
            "spouses": "-1",
            "awards": "-1",
            "fields": "-1",
            "parents": "Thục Chế",
            "childrens":"-1",
            "causeofdeath": "-1",
            "thesentences": "Chết thì bỏ con bỏ cháu Sống thì không bỏ mồng Sáu tháng Giêng",
            "incident": "-1",
            "typicalworks": "-1",
            "age":"Âu Lạc"
        },
        {
            "name":"Cao Bá Quát",
            "brief": "Cao Bá Quát (chữ Hán: 高伯适; 1809 – 1855), biểu tự Chu Thần (周臣), hiệu Mẫn Hiên (敏軒), lại có hiệu Cúc Đường (菊堂), là quân sư trong cuộc nổi dậy Mỹ Lương, và là một nhà thơ nổi danh ở giữa thế kỷ 19 trong lịch sử văn học Việt Nam.",
            "born": "làng Phú Thị, huyện Gia Lâm, tỉnh Bắc Ninh (nay thuộc xã Phú Thị, huyện Gia Lâm, Hà Nội)",
            "birthday": "năm 1809",
            "died": "năm 1855",
            "position":"Quốc sư",
            "education": "Nhà thơ",
            "knownfor": "là một nhà thơ nổi danh ở giữa thế kỷ 19 trong lịch sử văn học Việt Nam.",
            "spouses": "-1",
            "awards": "-1",
            "fields": "Nhà thơ",
            "parents": "-1",
            "childrens":"Cao Bá Thông, Cao Bá Phùng",
            "causeofdeath": "-1",
            "thesentences": "-1",
            "incident": "-1",
            "typicalworks": "Tài mai [Trồng mai], Thanh Trì phiếm châu nam hạ [Từ Thanh Trì buông thuyền xuôi nam], Quá Dục Thúy Sơn [Qua núi Dục Thúy]...",
            "age":"Triều Nguyễn"
        },
        {
            "name":"Đinh Bộ Lĩnh",
            "brief": "Đinh Tiên Hoàng (chữ Hán: 丁先皇; 22 tháng 3 năm 924 - tháng 10 năm 979), tên húy là Đinh Bộ Lĩnh (丁部領) hoặc có sách gọi Đinh Hoàn (丁桓) (xem mục Tên gọi bên dưới), là vị hoàng đế sáng lập triều đại nhà Đinh, nước Đại Cồ Việt trong lịch sử Việt Nam.",
            "born": "Gia Viễn, Ninh Bình, Giao Châu",
            "birthday": "ngày 22 tháng 3 năm 924",
            "died": "tháng 10 năm 979",
            "position":"Vua",
            "education": "-1",
            "knownfor": "Ông là người có công đánh dẹp loạn 12 sứ quân, thống nhất giang sơn và trở thành hoàng đế đầu tiên của Việt Nam sau thời Bắc thuộc",
            "spouses": "có 5 Hoàng hậu: Đan Gia Hoàng hậu, Trinh Minh Hoàng hậu, Kiểu Quốc Hoàng hậu, Cồ Quốc Hoàng hậu, Ca Ông Hoàng hậu.",
            "awards": "-1",
            "fields": "-1",
            "parents": "cha : Đinh Công Trứ. Mẹ : họ Đàm",
            "childrens":"Con trai: Đinh Liễn, Đinh Hạng Lang, Đinh Toàn. Con gái: Công chúa Phất Kim, Công chúa Phù Dung, Công chúa Minh Châu, Công chúa Liên Hoa, Công chúa Ngọc Nương",
            "causeofdeath": "-1",
            "thesentences": "-1",
            "incident": "-1",
            "typicalworks": "-1",
            "age":"Nhà Đinh (968 - 979)"
        },
        {
            "name":"Hồ Chí Minh",
            "brief": "Hồ Chí Minh (19 tháng 5 năm 1890 – 2 tháng 9 năm 1969), tên khai sinh là Nguyễn Sinh Cung,[2] là nhà cách mạng, người sáng lập Đảng Cộng sản Việt Nam, một trong những người đặt nền móng và lãnh đạo công cuộc đấu tranh giành độc lập, toàn vẹn lãnh thổ cho Việt Nam trong thế kỷ XX, một chiến sĩ cộng sản quốc tế. Ông là người viết và đọc bản Tuyên ngôn Độc lập khai sinh nước Việt Nam Dân chủ Cộng hòa ngày 2 tháng 9 năm 1945 tại Quảng trường Ba Đình, Hà Nội, là Chủ tịch nước Việt Nam Dân chủ Cộng hòa trong thời gian 1945–1969, Chủ tịch Ban Chấp hành Trung ương Đảng Lao động Việt Nam trong thời gian 1951–1969.",
            "born": "Nghệ An, Liên bang Đông Dương",
            "birthday": "ngày 19 tháng 5, 1890",
            "died": "ngày 2 tháng 9, 1969",
            "position":"Chủ tịch nước",
            "education": "-1",
            "knownfor": "Chủ tịch đầu tiên Việt Nam Dân chủ Cộng hòa",
            "spouses": "Vợ : Tăng Tuyết Minh",
            "awards": "-1",
            "fields": "Nhà thơ, nhà văn, nhà chính trị",
            "parents": "Cha : Nguyễn Sinh Sắc. Mẹ : Hoàng Thị Loan",
            "childrens":"-1",
            "causeofdeath": "-1",
            "thesentences": "Không có việc gì khó, Chỉ sợ lòng không bền. Đào núi và lấp biển, Quyết chí ắt làm nên",
            "incident": "-1",
            "typicalworks": "Tuyên ngôn độc lập (Việt Nam Dân chủ Cộng hòa), Bản án chế độ thực dân Pháp (1925), Đường kách mệnh (1927)...",
            "age":"2 tháng 9 năm 1945 – 2 tháng 9 năm 1969"
        },
        {
            "name":"Hồ Quý Ly",
            "brief": "Hồ Quý Ly (chữ Hán: 胡季犛 1336 – 1407?), lấy tên húy Hồ Nhất Nguyên, là vị hoàng đế đầu tiên của nhà nước Đại Ngu trong lịch sử Việt Nam. Ông ở ngôi vị Hoàng đế từ năm 1400 đến năm 1401, sau đó giữ ngôi Thái thượng hoàng từ năm 1401 đến năm 1407.",
            "born": "Thanh Hóa, Việt Nam",
            "birthday": "năm 1336",
            "died": "năm 1407",
            "position":"Hoàng Đế",
            "education": "-1",
            "knownfor": "là vị hoàng đế đầu tiên của nhà nước Đại Ngu",
            "spouses": "Thái Từ Hoàng hậu",
            "awards": "-1",
            "fields": "-1",
            "parents": "Cha : Lê Quốc Mạo. Mẹ : Phạm Phu nhân",
            "childrens":"con gái Danh y Phạm Công Bân",
            "causeofdeath": "Có thuyết nói ông bị nhà Minh sát hại khi sang Yên Kinh (Bắc Kinh), có thuyết lại nói ông bị đày làm lính ở Quảng Tây và mất sau đó vài năm. Theo Minh thực lục, cha con Hồ Quý Ly được tha tội",
            "thesentences": "-1",
            "incident": "-1",
            "typicalworks": "-1",
            "age":"22 tháng 3 năm 1400 - tháng 12 năm 1401"
        },
        {
            "name":"Lê Đại Hành",
            "brief": "Lê Đại Hành (chữ Hán: 黎大行; 941 – 1005) là vị hoàng đế sáng lập nhà Tiền Lê nước Đại Cồ Việt, trị vì nước Đại Cồ Việt trong 24 năm.",
            "born": "Tĩnh Hải quân",
            "birthday": "ngày 10 tháng 8, 941",
            "died": "năm 1005",
            "position":"Hoàng đế Đại Cồ Việt",
            "education": "-1",
            "knownfor": "vị hoàng đế sáng lập nhà Tiền Lê nước Đại Cồ Việt",
            "spouses": "Lê Đại Hành có 5 hoàng hậu gồm Đại Thắng Minh Hoàng hậu (Dương Vân Nga), Phụng Càn Chí Lý Hoàng hậu, Thuận Thánh Minh Đạo Hoàng hậu, Trịnh Quắc Hoàng hậu và Phạm Hoàng hậu",
            "awards": "-1",
            "fields": "-1",
            "parents": "Cha : Lê Mẫu. Mẹ : Đặng Thị",
            "childrens":"có 13 người con, 11 người con trai, 1 người con gái, 1 người con nuôi. 11 người con trai và cả con trai nuôi đều được phong vương",
            "causeofdeath": "Mùa xuân, tháng 3 năm 1005, Lê Hoàn chết ở điện Trường Xuân, gọi là Đại Hành Hoàng Đế, sau nhân đó dùng làm miếu hiệu mà không đổi, triều đình chôn ở sơn lăng châu Trường Yên. Các người con là Lê Long Việt, Đông Thành vương, Trung Quốc vương, Khai Minh vương tranh ngôi 8 tháng khiến nước không có chủ",
            "thesentences": "-1",
            "incident": "-1",
            "typicalworks": "-1",
            "age":"Đinh Toàn (nhà Đinh)"
        },
        {
            "name":"Lê Thái Tổ",
            "brief": "Lê Thái Tổ (chữ Hán: 黎太祖 10 tháng 9, 1385[2] – 5 tháng 10, 1433) tên thật là Lê Lợi (黎利), là một nhà lãnh đạo quân sự, người đã thành lập một đội quân người Việt và lãnh đạo đội quân này chiến đấu chống lại sự chiếm đóng của quân đội nhà Minh (Trung Quốc) từ năm 1418 cho đến lúc đánh đuổi hoàn toàn quân Minh ra khỏi Đại Việt vào năm 1428. Ông cũng thành công với các chiến dịch quân sự đánh dẹp các tù trưởng ở biên giới phía Bắc Đại Việt và quân đội Ai Lao. Ông là Vua của nước Đại Việt từ năm 1428 cho tới năm 1433.",
            "born": "Lam Sơn, Thanh Hóa",
            "birthday": "ngày 10 tháng 9, 1383/1385",
            "died": "ngày 5 tháng 10, 1433",
            "position":"Vua của nước Đại Việt từ năm 1428 cho tới năm 1433",
            "education": "-1",
            "knownfor": "Khởi nghĩa Lam Sơn",
            "spouses": "Cung Từ Cao Hoàng hậu",
            "awards": "-1",
            "fields": "-1",
            "parents": "Cha : Lê Khoáng. Mẹ : Trịnh Ngọc Thương",
            "childrens":"Quận Ai vương Lê Tư Tề, Lê Thái Tông (Lê Nguyên Long), Lê Thị Đào Nữ, Lê Thị Ngọc Châu",
            "causeofdeath": "-1",
            "thesentences": "-1",
            "incident": "-1",
            "typicalworks": "-1",
            "age":"29 tháng 4 năm 1428 – 5 tháng 10 năm 1433"
        },
        {
            "name":"Nguyễn Thị Minh Khai",
            "brief": "là nhà cách mạng Việt Nam, một trong những người lãnh đạo Đảng Cộng sản Đông Dương trong giai đoạn 1930-1940.",
            "born": "xã Vĩnh Yên, thành phố Vinh, tỉnh Nghệ An",
            "birthday": "ngày 1 tháng 11 năm 1910",
            "died": "ngày 28 tháng 8 năm 1941",
            "position":"một trong những người lãnh đạo Đảng Cộng sản Đông Dương",
            "education": "-1",
            "knownfor": "Nguyễn Thị Minh Khai nhận mình là vợ của Hồ Chí Minh vào thời điểm năm 1931 (sau này tại Moskva cuối năm 1934, bà cũng đã viết rằng mình đã có gia đình với Lin, bí danh của Hồ Chí Minh vào thời điểm đó)",
            "spouses": "Lê Hồng Phong",
            "awards": "Tên của bà được đặt cho nhiều đường phố trên khắp Việt Nam như tại: thành phố Hạ Long (từ đường Vũ Văn Hiếu đến hang Luồn), Đồng Hới (gần sân vận động),Đà Lạt (khu chợ đêm), Nha Trang (ngay cạnh quảng trường 2 tháng 4,từ đường Trần Phú đến đường Trần Nhật Duật), Đà nẵng (gần nhà hát Trưng Vương",
            "fields": "-1",
            "parents": "Cha bà là ông Nguyễn Huy Bình, Mẹ là Đậu Thị Thư",
            "childrens":"Lê Nguyễn Hồng Minh",
            "causeofdeath": "Sau khi Khởi nghĩa Nam Kỳ thất bại, bà bị thực dân Pháp kết án tử hình và bị xử bắn tại Ngã ba Giồng, Hóc Môn ngày 28 tháng 8 năm 1941.",
            "thesentences": "-1",
            "incident": "-1",
            "typicalworks": "-1",
            "age":"1930-1940"
        },
        {
            "name":"Nguyễn Trãi",
            "brief": "Nguyễn Trãi (chữ Hán: 阮廌, 1380 – 19 tháng 9 năm 1442), hiệu là Ức Trai (抑齋), là người đã tham gia tích cực Khởi nghĩa Lam Sơn do Lê Lợi lãnh đạo chống lại sự xâm lược của nhà Minh (Trung Quốc) với Đại Việt. Khi cuộc khởi nghĩa thành công vào năm 1428, Nguyễn Trãi trở thành khai quốc công thần của triều đại quân chủ nhà Hậu Lê trong Lịch sử Việt Nam.",
            "born": "Thăng Long, Đại Việt",
            "birthday": "năm 1380",
            "died": "ngày 19 tháng 9, 1442",
            "position":"Nhà chính trị, Nhà thơ, Nhà địa lý học, Nhà ngoại giao",
            "education": "Thái học sinh (Tiến sĩ)",
            "knownfor": "Tham gia Khởi nghĩa Lam Sơn",
            "spouses": "Bà Trần Thị Thành, Bà Phùng thị, Bà Lê thị, Bà Nguyễn Thị Lộ, Bà Phạm Thị Mẫn",
            "awards": "Anh hùng dân tộc - Danh nhân thế giới",
            "fields": "Thơ, Cáo, Chiếu, Biểu, Tấu",
            "parents": "Cha : Nguyễn Phi Khanh",
            "childrens":"Nguyễn Khuê (con bà Trần Thị), Nguyễn Ứng (con bà Trần Thị), Nguyễn Phù (con bà Trần Thị), Nguyễn Bảng (con bà Phùng Thị), Nguyễn Tích (con bà Phùng Thị), Nguyễn Anh Vũ (con bà Phạm Thị)",
            "causeofdeath": "Tháng 9 năm 1442, vua Lê Thái Tông đi tuần ở miền Đông. Ngày 1 tháng 9 năm 1442, sau khi nhà vua duyệt binh ở thành Chí Linh, Nguyễn Trãi đón Lê Thái Tông đi thuyền vào chơi chùa Côn Sơn. Khi trở về Đông Kinh, người thiếp của Nguyễn Trãi là Nguyễn Thị Lộ theo hầu vua. Ngày 7 tháng 9 năm 1442, thuyền về đến Lệ Chi Viên thì vua bị bệnh, thức suốt đêm với Nguyễn Thị Lộ rồi mất. Các quan giấu kín chuyện này, nửa đêm ngày 9 tháng 9 năm 1442 về đến Đông Kinh mới phát tang. Triều đình qui tội Nguyễn Thị Lộ giết vua, bèn bắt bà và Nguyễn Trãi, khép hai người vào âm mưu giết vua. Ngày 19 tháng 9 năm 1442 (tức ngày 16 tháng 8 năm Nhâm Tuất), Nguyễn Trãi bị giết cùng người thân 3 họ, gọi là tru di tam tộc.",
            "thesentences": "Đem đại nghĩa để thắng hung tàn. Lấy chí nhân để thay cường bạo",
            "incident": "vụ án Lệ Chi Viên",
            "typicalworks": "Bình Ngô đại cáo, Quốc âm thi tập, Quân trung từ mệnh tập, Dư địa chí",
            "age":"1930-1940"
        }
    ]
}